{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 227, 227, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv1", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_conv1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "relu_conv1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": false, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool1", "inbound_nodes": [[["relu_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire2/squeeze1x1", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire2/squeeze1x1", "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire2/relu_squeeze1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire2/relu_squeeze1x1", "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire2/expand1x1", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire2/expand1x1", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire2/expand3x3", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire2/expand3x3", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire2/relu_expand1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire2/relu_expand1x1", "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire2/relu_expand3x3", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire2/relu_expand3x3", "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire2/concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "fire2/concat", "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire3/squeeze1x1", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire3/squeeze1x1", "inbound_nodes": [[["fire2/concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire3/relu_squeeze1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire3/relu_squeeze1x1", "inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire3/expand1x1", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire3/expand1x1", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire3/expand3x3", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire3/expand3x3", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire3/relu_expand1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire3/relu_expand1x1", "inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire3/relu_expand3x3", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire3/relu_expand3x3", "inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire3/concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "fire3/concat", "inbound_nodes": [[["fire3/relu_expand1x1", 0, 0, {}], ["fire3/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": false, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool3", "inbound_nodes": [[["fire3/concat", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire4/squeeze1x1", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire4/squeeze1x1", "inbound_nodes": [[["pool3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire4/relu_squeeze1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire4/relu_squeeze1x1", "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire4/expand1x1", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire4/expand1x1", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire4/expand3x3", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire4/expand3x3", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire4/relu_expand1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire4/relu_expand1x1", "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire4/relu_expand3x3", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire4/relu_expand3x3", "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire4/concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "fire4/concat", "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire5/squeeze1x1", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire5/squeeze1x1", "inbound_nodes": [[["fire4/concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire5/relu_squeeze1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire5/relu_squeeze1x1", "inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire5/expand1x1", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire5/expand1x1", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire5/expand3x3", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire5/expand3x3", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire5/relu_expand1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire5/relu_expand1x1", "inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire5/relu_expand3x3", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire5/relu_expand3x3", "inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire5/concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "fire5/concat", "inbound_nodes": [[["fire5/relu_expand1x1", 0, 0, {}], ["fire5/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool5", "trainable": false, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool5", "inbound_nodes": [[["fire5/concat", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire6/squeeze1x1", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire6/squeeze1x1", "inbound_nodes": [[["pool5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire6/relu_squeeze1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire6/relu_squeeze1x1", "inbound_nodes": [[["fire6/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire6/expand1x1", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire6/expand1x1", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire6/expand3x3", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire6/expand3x3", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire6/relu_expand1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire6/relu_expand1x1", "inbound_nodes": [[["fire6/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire6/relu_expand3x3", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire6/relu_expand3x3", "inbound_nodes": [[["fire6/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire6/concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "fire6/concat", "inbound_nodes": [[["fire6/relu_expand1x1", 0, 0, {}], ["fire6/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire7/squeeze1x1", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire7/squeeze1x1", "inbound_nodes": [[["fire6/concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire7/relu_squeeze1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire7/relu_squeeze1x1", "inbound_nodes": [[["fire7/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire7/expand1x1", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire7/expand1x1", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire7/expand3x3", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire7/expand3x3", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire7/relu_expand1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire7/relu_expand1x1", "inbound_nodes": [[["fire7/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire7/relu_expand3x3", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire7/relu_expand3x3", "inbound_nodes": [[["fire7/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire7/concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "fire7/concat", "inbound_nodes": [[["fire7/relu_expand1x1", 0, 0, {}], ["fire7/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire8/squeeze1x1", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire8/squeeze1x1", "inbound_nodes": [[["fire7/concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire8/relu_squeeze1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire8/relu_squeeze1x1", "inbound_nodes": [[["fire8/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire8/expand1x1", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire8/expand1x1", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire8/expand3x3", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire8/expand3x3", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire8/relu_expand1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire8/relu_expand1x1", "inbound_nodes": [[["fire8/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire8/relu_expand3x3", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire8/relu_expand3x3", "inbound_nodes": [[["fire8/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire8/concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "fire8/concat", "inbound_nodes": [[["fire8/relu_expand1x1", 0, 0, {}], ["fire8/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire9/squeeze1x1", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire9/squeeze1x1", "inbound_nodes": [[["fire8/concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire9/relu_squeeze1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire9/relu_squeeze1x1", "inbound_nodes": [[["fire9/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire9/expand1x1", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire9/expand1x1", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire9/expand3x3", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire9/expand3x3", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire9/relu_expand1x1", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire9/relu_expand1x1", "inbound_nodes": [[["fire9/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire9/relu_expand3x3", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "fire9/relu_expand3x3", "inbound_nodes": [[["fire9/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire9/concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "fire9/concat", "inbound_nodes": [[["fire9/relu_expand1x1", 0, 0, {}], ["fire9/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling2D", "config": {"name": "global_max_pooling2d", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling2d", "inbound_nodes": [[["fire9/concat", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["global_max_pooling2d", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 3, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.9.0", "backend": "tensorflow"}